In [2]:
import numpy as np
#file I/O
a = np.array([[1,2,3],[4,5,6],[7,8,9]])
a
np.save("test",a)
# binary형태로 저장

In [3]:
%ls

 C 드라이브의 볼륨에는 이름이 없습니다.
 볼륨 일련 번호: 76CD-579A

 C:\Users\acorn\jupyter_workspace 디렉터리

2018-10-25  오전 10:10    <DIR>          .
2018-10-25  오전 10:10    <DIR>          ..
2018-10-25  오전 10:07    <DIR>          .ipynb_checkpoints
2018-10-25  오전 10:10           540,090 day1.ipynb
2018-10-25  오전 09:49    <DIR>          img
2018-10-24  오후 04:09               262 korea.txt
2018-10-23  오후 05:20               846 ML01.ipynb
2018-10-24  오후 03:47               545 populations.txt
2018-10-25  오전 10:10               164 test.npy
2018-10-23  오후 05:14                72 Untitled.ipynb
2018-10-24  오전 10:07                72 Untitled1.ipynb
2018-10-25  오전 10:08             2,287 Untitled2.ipynb
               8개 파일             544,338 바이트
               4개 디렉터리  185,749,987,328 바이트 남음

In [4]:
np.load("test.npy")

array([[1, 2, 3],
       [4, 5, 6],
       [7, 8, 9]])

In [16]:
data = np.arange(0,10,1)
data
np.savetxt("test2.txt",data)

In [17]:
temp2 = np.loadtxt("test2.txt")
temp2

array([0., 1., 2., 3., 4., 5., 6., 7., 8., 9.])

In [18]:
temp3 = np.loadtxt("test2.txt",delimiter=",")# 구분문자
temp3

array([0., 1., 2., 3., 4., 5., 6., 7., 8., 9.])

In [20]:
n=3
a=np.eye(n)
print("a: ")
print(a) # 단위 행렬

# 칼럼 추가
b = np.c_[a,a[2]]
print("b: ")
print(b) # 열이 하나 추가된 것을 볼 수 있다.

# 행 추가
c = np.r_[a,[a[2]]]
print("c: ")
print(c) # 행이 하나 추가된 것을 볼 수 있다.

a:
[[1. 0. 0.]
 [0. 1. 0.]
 [0. 0. 1.]]
b:
[[1. 0. 0. 0.]
 [0. 1. 0. 0.]
 [0. 0. 1. 1.]]
c:
[[1. 0. 0.]
 [0. 1. 0.]
 [0. 0. 1.]
 [0. 0. 1.]]

In [21]:
print("--------------------------------------------")
print("Pandas")

--------------------------------------------
Pandas

In [24]:
from pandas import Series
obj = Series([3,7,-5,4])

print(obj, type(obj))

0    3
1    7
2   -5
3    4
dtype: int64 <class 'pandas.core.series.Series'>

In [25]:
obj2 = Series([3,7,-5,4], index=['a','b','c','d'])
print(obj2)

a    3
b    7
c   -5
d    4
dtype: int64

In [26]:
print(obj2.values)

[ 3  7 -5  4]

In [27]:
print(obj2.index)

Index(['a', 'b', 'c', 'd'], dtype='object')

In [28]:
print(obj2['a'])

3

In [31]:
# 1번부터 4번 까지
print(obj2[1:4])

b    7
c   -5
d    4
dtype: int64

In [33]:
print(obj2[obj2>0])

a    3
b    7
d    4
dtype: int64

In [35]:
print('a' in obj2) # TRUE

True

In [46]:
print("dict type 으로 Series 객체 생성")
names = {'mouse':12700, 'keyboard':25000, 'monitor':56000}
print(names)

obj3 = Series(names)
obj3

# 제품명 출력
print(obj3.index)

# 가격만 출력
print(obj3.values)

# 마우스의 가격
print(obj3['mouse'])
obj3.name="상품가격"
obj3.index.name="상품명"

print(obj3)

dict type 으로 Series 객체 생성
{'mouse': 12700, 'keyboard': 25000, 'monitor': 56000}
Index(['mouse', 'keyboard', 'monitor'], dtype='object')
[12700 25000 56000]
12700
상품명
mouse       12700
keyboard    25000
monitor     56000
Name: 상품가격, dtype: int64

<h3>DataFrame : 표모양(2차원배열의 자료구조를 지원</h3>

In [61]:
from pandas import Series, DataFrame

data = {
    "name" : ["홍길동","이순신","지혀니","리리","반장"],
    "addr" : ["율도국","조선","하안동","원흥동","탄현동"],
    "age" : [550,480,22,22,28]
}

print(data, type(data))

{'name': ['홍길동', '이순신', '지혀니', '리리', '반장'], 'addr': ['율도국', '조선', '하안동', '원흥동', '탄현동'], 'age': [550, 480, 22, 22, 28]} <class 'dict'>

In [62]:
df = DataFrame(data)
df

  name addr  age
0  홍길동  율도국  550
1  이순신   조선  480
2  지혀니  하안동   22
3   리리  원흥동   22
4   반장  탄현동   28

In [63]:
print(df)

  name addr  age
0  홍길동  율도국  550
1  이순신   조선  480
2  지혀니  하안동   22
3   리리  원흥동   22
4   반장  탄현동   28

In [64]:
print(type(df))

<class 'pandas.core.frame.DataFrame'>

In [65]:
print(df["name"])
print(df.name)

0    홍길동
1    이순신
2    지혀니
3     리리
4     반장
Name: name, dtype: object
0    홍길동
1    이순신
2    지혀니
3     리리
4     반장
Name: name, dtype: object

In [68]:
df = DataFrame(data, columns=['name','addr','age'])
df

  name addr  age
0  홍길동  율도국  550
1  이순신   조선  480
2  지혀니  하안동   22
3   리리  원흥동   22
4   반장  탄현동   28

In [71]:
df2 = DataFrame(data, columns=['name','addr','age','tel'],
              index=['a','b','c','d','e'])
df2

  name addr  age  tel
a  홍길동  율도국  550  NaN
b  이순신   조선  480  NaN
c  지혀니  하안동   22  NaN
d   리리  원흥동   22  NaN
e   반장  탄현동   28  NaN

In [73]:
# 홍길동 전화번호 : 010-1234-5678

df2["tel"]='010-1234-5678'
df2

  name addr  age            tel
a  홍길동  율도국  550  010-1234-5678
b  이순신   조선  480  010-1234-5678
c  지혀니  하안동   22  010-1234-5678
d   리리  원흥동   22  010-1234-5678
e   반장  탄현동   28  010-1234-5678

In [77]:
s1 = Series(['010-1111-2222','010-1111-3333','010-1111-4444'],
           index=['b','c','e'])
s1

b    010-1111-2222
c    010-1111-3333
e    010-1111-4444
dtype: object

In [78]:
df2["tel"]=s1
df2

  name addr  age            tel
a  홍길동  율도국  550            NaN
b  이순신   조선  480  010-1111-2222
c  지혀니  하안동   22  010-1111-3333
d   리리  원흥동   22            NaN
e   반장  탄현동   28  010-1111-4444

In [79]:
df2.T

        a              b              c    d              e
name  홍길동            이순신            지혀니   리리             반장
addr  율도국             조선            하안동  원흥동            탄현동
age   550            480             22   22             28
tel   NaN  010-1111-2222  010-1111-3333  NaN  010-1111-4444

In [80]:
df2.values

array([['홍길동', '율도국', 550, nan],
       ['이순신', '조선', 480, '010-1111-2222'],
       ['지혀니', '하안동', 22, '010-1111-3333'],
       ['리리', '원흥동', 22, nan],
       ['반장', '탄현동', 28, '010-1111-4444']], dtype=object)

In [81]:
df2.values[0:2]

array([['홍길동', '율도국', 550, nan],
       ['이순신', '조선', 480, '010-1111-2222']], dtype=object)

<h3>속성으로 axis = 0 행 , axis = 1 열</h3>

In [84]:
df3 = df2.drop('a') # 기본값은 행기준(홍길동 삭제)
df3

  name addr  age            tel
b  이순신   조선  480  010-1111-2222
c  지혀니  하안동   22  010-1111-3333
d   리리  원흥동   22            NaN
e   반장  탄현동   28  010-1111-4444

In [87]:
# 나이 컬럼 삭제
df4 = df3.drop('age',axis=1)
df4

  name addr            tel
b  이순신   조선  010-1111-2222
c  지혀니  하안동  010-1111-3333
d   리리  원흥동            NaN
e   반장  탄현동  010-1111-4444

In [89]:
df2.sort_values("name")

  name addr  age            tel
d   리리  원흥동   22            NaN
e   반장  탄현동   28  010-1111-4444
b  이순신   조선  480  010-1111-2222
c  지혀니  하안동   22  010-1111-3333
a  홍길동  율도국  550            NaN

In [98]:
# index를 기준으로 정렬 출력(df2)
df2.sort_index(ascending=False, axis=0) # ascending =True 기본값

  name addr  age            tel
e   반장  탄현동   28  010-1111-4444
d   리리  원흥동   22            NaN
c  지혀니  하안동   22  010-1111-3333
b  이순신   조선  480  010-1111-2222
a  홍길동  율도국  550            NaN

In [101]:
# 전화번호를 기준으로 내림차순으로 정렬한 df2를 출력
df2.sort_values("tel",ascending=False) # ascending =True 기본값

  name addr  age            tel
e   반장  탄현동   28  010-1111-4444
c  지혀니  하안동   22  010-1111-3333
b  이순신   조선  480  010-1111-2222
a  홍길동  율도국  550            NaN
d   리리  원흥동   22            NaN

In [104]:
# 색을 기준으로 정렬, 행기준, 열기준
df2.sort_index(ascending=True, axis=0)

  name addr  age            tel
a  홍길동  율도국  550            NaN
b  이순신   조선  480  010-1111-2222
c  지혀니  하안동   22  010-1111-3333
d   리리  원흥동   22            NaN
e   반장  탄현동   28  010-1111-4444

In [105]:
df2.sort_index(ascending=True, axis=1)

  addr  age name            tel
a  율도국  550  홍길동            NaN
b   조선  480  이순신  010-1111-2222
c  하안동   22  지혀니  010-1111-3333
d  원흥동   22   리리            NaN
e  탄현동   28   반장  010-1111-4444

In [106]:
# 오른차순 정렬한 후에 순위를 주여
df2.rank(axis=0)

   name  addr  age  tel
a   5.0   2.0  5.0  NaN
b   3.0   3.0  4.0  1.0
c   4.0   5.0  1.5  2.0
d   1.0   1.0  1.5  NaN
e   2.0   4.0  3.0  3.0

In [109]:
df2.rank(axis=0, ascending=False)

   name  addr  age  tel
a   1.0   4.0  1.0  NaN
b   3.0   3.0  2.0  3.0
c   2.0   1.0  4.5  2.0
d   5.0   5.0  4.5  NaN
e   4.0   2.0  3.0  1.0

In [131]:
# student.txt 파일을 읽어와서
# DataFrame 객체를 생성
# 컬럼 이름 : no name height weight
import pandas as pd
#df5 = pd. sep="\t", header=1,


student = pd.read_table('student.txt', names= ['no','name','height','weight'])
student

# age 컬럼 추가
student = DataFrame(student, columns=['no','name','height','weight','age'])
# 기본값은 20
student["age"]=20
# kim, lee의 나이를 22로 변경
s1 = Series(22, index=['kim','lee'])
student["age"]=s1
# 몸무게는 비밀... weight컬럼 삭제
#student = student.drop('weight',axis=1)
# 키가 큰순(내림차순)으로 출력
student

    no  name  height  weight  age
0  101  hong     175      65  NaN
1  201   lee     185      85  NaN
2  301   kim     173      60  NaN
3  401  park     180      70  NaN